#+title:Emacs configuration
#+author:Giovani Pedroso
#+EXPORT_FILE_NAME: ~/codes/Web/giovani-web-design/Front-end/src/lib/blog/My-emacs-configuration.svelte
#+LANGUAGE:  en
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el


My main goal of this configuration is to turn the emacs into a IDE for working with React, nodeJs and embedded system like stm32 and esp-idf. I made this configuration using the tutorials of the channel [[https://www.youtube.com/c/SystemCrafters][SystemCrafters]]

C-M-\ format the code block

*** ParaEdit

#+begin_src emacs-lisp
  (use-package paredit
    :ensure t)
  (autoload 'enable-paredit-mode "paredit" "Turn on pseudo-structural editing of Lisp code." t)
  (add-hook 'emacs-lisp-mode-hook       #'enable-paredit-mode)
  (add-hook 'eval-expression-minibuffer-setup-hook #'enable-paredit-mode)
  (add-hook 'ielm-mode-hook             #'enable-paredit-mode)
  (add-hook 'lisp-mode-hook             #'enable-paredit-mode)
  (add-hook 'lisp-interaction-mode-hook #'enable-paredit-mode)
  (add-hook 'scheme-mode-hook           #'enable-paredit-mode)
#+end_src

#+RESULTS:
| enable-paredit-mode |
